package Tsukanova;

public class MainPerson {
    //    Зробіть програму для фітнес трекера, яка реєструватиме нового користувача створюючи
//    йому обліковий запис, приймаючи наступні параметри:
//    Незмінні (задаються тільки при створенні облікового запису, і можуть бути
//    отримані лише за допомогою гетерів):
//    Ім'я
//    Дата народження (окремо день, місяць, рік)
//    Емейл
//            Телефон
//    Змінювані:
//    Прізвище
//            Вага
//    Тиск
//    Кількість пройдених за день кроків
//    Створювати кожного користувача необхідно через конструктор, беручи всі поля на вхід конструктора.
//    Додати метод printAccountInfo(), при виклику якого друкувати всі дані про користувача
//    Після прийому року народження - вираховувати вік користувача у внутрішню змінну age
//    (відштовхуючись просто від 2020 року, ускладнювати тут не будемо), на яку зробити тільки геттер
//    і виводити на екран разом з іншими полями в методі printAccountInfo(); у конструкторі або
//    геттерах/сеттерах не використовуємо виведення в консоль.
//    У main-класі створити 3-5 користувачів та роздрукувати дані кожного через
//    виклик методу printAccountInfo(); для двох користувачів змінити кілька полів
//    та роздрукувати нові дані повторно

    public static void main(String[]args) {
        Person dd1=new Person("Sii",1,1,1900,
                "@fffff","0800 00 00","Fofo",
                555,444,777,2023);
        Person dd2=new Person("Вввв",1,1,2000,
                "@fffff","0800 00 00","Ррара",
                666,444,777,2023);
        dd1.setLastName("GGGGGGGGGG");
        dd1.printAccountInfo();
        dd2.printAccountInfo();

    }

}
